package chapter19.array;

/*
Array
    1、Java语言中的数组是一种引用数据类型。不属于基本数据类型。数组的父类是Object
    2、数组实际上是一个容器，可以同时容纳多个元素（数组是一个数据的集合）
        数组：字面意思是“一组数据”
    3、数组当中可以存储“基本数据类型”的数据，也可以存储“引用数据类型”的数据
    4、数组因为是引用类型，所以数组对象是堆内存当中。（数组是存储在堆当中的）
    5、数组当中如果存储的是“java对象”的话，实际上存储的是对象的“引用（内存地址）”
    6、数组一旦创建，在java中规定，长度不可变。（数组长度不可变）
    7、数组的分类：一维数组、二维数组、三维数组、多维数组。。。（一维数组较多，二维数组偶尔使用！）
    8、所有的数组对象都有length属性（java自带的），用来获取数组中元素的个数
    9、java中的数组要求数组中元素的类型统一。比如int类型数组只能存储int类型，Person类型数组只能存储Person类型
        例如：超市购物，购物袋在只能装苹果，不能同时装苹果和橘子
    10、*/

public class ArrayTest01 {
}
